/*
  Copyright (c) 2018 Daniel John Erdos

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 2 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

*/

/************************************************************************************/
/* Example edit macro to change literal to text in the panels directory             */
/* Run from REXX runemac                                                            */
/*                                                                                  */
/* Switch off recovery as we should already have a backup of the directory before   */
/* running this.                                                                    */
/************************************************************************************/

address ISREDIT

"MACRO (A) NOPROCESS"

"(rec)   = RECOVERY"
"(,lock) = PROFILE"

if rec = "ON" then
  do
    if lock = "LOCK" then "PROFILE UNLOCK"
    "RECOVERY OFF"
    if lock = "LOCK" then "PROFILE LOCK"
  end


"FIND ')BODY' 1 FIRST"
if RC \= 0 then
  do
    say ")BODY statement not found.  Exiting..."
    "BUILTIN CANCEL"
    EXIT
  end

"(ROW) = LINENUM .ZCSR"
"LABEL "ROW" = .A"

"FIND ')' 1 NEXT"
if RC \= 0 then
  do
    say "Next section after )BODY statement not found.  Exiting..."
    "BUILTIN CANCEL"
    EXIT
  end

"(ROW) = LINENUM .ZCSR"
"LABEL "ROW" = .B"

"CHANGE LITERAL 'text   ' 1 .A .B ALL"

"(DCHA) = DATA_CHANGED"

if dcha = "YES" then
  do
     "(MFILE) = DATASET"
     "(CHG,ERR)  = CHANGE_COUNTS"
     say CHG "changes made with "ERR" errors.  Saving file "MFILE
     "BUILTIN SAVE"
  end
else
  do
     say "No changes made."
  end

if rec = "ON" then
  do
    if lock = "LOCK" then "PROFILE UNLOCK"
    "RECOVERY ON"
    if lock = "LOCK" then "PROFILE LOCK"
  end

"BUILTIN END"

EXIT
