/*
  Copyright (c) 2020 Daniel John Erdos

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 2 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

*/

/*****************************************************************************/
/* REXX to browse a file using the od command                                */
/*****************************************************************************/

tfile = systempfilename( "/tmp/od-????-????" )

address bash "od --endian=big -t x2z '"arg(1)"' &> "tfile

address ISPEXEC

ZBRALT = "DUMP:" arg( 1 )
"VPUT ZBRALT SHARED"

"CONTROL ERRORS RETURN"
"BROWSE FILE(TFILE)"
if RC > 0 then
  do
    say "No data to browse"
  end

"CONTROL ERRORS CANCEL"
"VERASE ZBRALT SHARED"

Call sysfiledelete( tfile )

EXIT
