/*
  Copyright (c) 2018 Daniel John Erdos

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 2 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

*/

/* Re-direct say ouput and error messages to the spool or it'll mess up lspf output */
parse source . . src .
Call setdest src
/************************************************************************************/

/* Run edit macro emac against all files in directory dir  */
/* Run in applid BTCH so it does not interfer with online  */

address ISPEXEC

"VGET ZAPPLID SHARED"
if zapplid \= "BTCH" then
  do
    "SELECT CMD(runemac) NEWAPPL(BTCH)"
    EXIT
  end

dir = "/home/daniel/.lspf/plib/"
Call sysfiletree dir, "file", "FO"

"CONTROL ERRORS RETURN"

do i = 1 to file.0
   f = word( file.i, 1)
   "RDISPLAY Editing file &f"
   "EDIT FILE(&f) MACRO(emac) PROFILE(BATCH)"
   if RC = 14 then
     do
       "RDISPLAY Error.  File in use.  RC=&RC"
     end
   else if RC = 20 then
     do
       "RDISPLAY A severe error has occured.  RC=&RC"
     end
   else
     do
       "RDISPLAY RC=&RC"
     end
  "RDISPLAY "
end

EXIT
