/*
  Copyright (c) 2018 Daniel John Erdos

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 2 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

*/

/* ******************************************************* */
/*                                                         */
/* Run edit macro emac against files in directory dir.     */
/* A pattern can be used to select only certain files.     */
/* Run in applid BTCH so it does not interfer with online. */
/*                                                         */
/* ******************************************************* */

address ISPEXEC

"VGET ZAPPLID SHARED"
if zapplid \= "BTCH" then
  do
    "SELECT CMD(runemac) NEWAPPL(BTCH)"
    EXIT
  end

dir  = "/home/daniel/.lspf/plib/"
emac = "emact"

ddname = "$"random( 0, 9999999 )
address TSO "ALLOC FILE("ddname") PATH("dir")"
"LMINIT DATAID(DID) DDNAME(&ddname) ENQ(SHR)"
"LMOPEN DATAID(&did) OPTION(INPUT)"

"CONTROL ERRORS RETURN"

"LMMLIST DATAID(&did) OPTION(LIST) MEMBER(MEM)"
do while RC = 0
   file = (dir)mem
   say "Editing file "mem
   "EDIT FILE(&file) MACRO(&emac) PROFILE(BATCH)"
   if RC = 14 then
     do
       say "Error.  File in use.  RC="RC
     end
   else if RC = 20 then
     do
       say "A severe error has occured.  RC="RC
     end
   else
     do
--     say "RC="RC
     end
   "LMMLIST DATAID(&did) OPTION(LIST) MEMBER(MEM)"
end

"LMMLIST DATAID(&did) OPTION(FREE)"
"LMFREE DATAID(&did)"
address TSO "FREE FI("ddname")"

EXIT
