/*
  Copyright (c) 2015 Daniel John Erdos

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 2 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

*/
arg msg .

address ISPEXEC

"control errors return"

"GETMSG MSG(&msg) SHORTMSG(A) LONGMSG(B) TYPE(C) ALARM(D) HELP(E) WINDOW(F)"

if RC = 12 then
  do
    say "Message" msg "Not Found"
    exit
  end
else if RC > 0 then
  do
    say "Error in message "msg" or message file"
    exit
  end

say "SMSG. . .:" A
say "LMSG. . .:" B
say "TYPE. . .:" C
say "ALRM. . .:" D
say "HELP. . .:" E
say "WINDOW. .:" F

exit
